## Plan Result
[CI link](https://github.com/rindrics-sandbox-org/terraform-operations/actions/runs/11920529061)


<pre><code>Plan: 3 to import, 23 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * github_repository.all_in_one[&#34;bar&#34;]
  * github_repository.all_in_one[&#34;baz&#34;]
  * github_repository.all_in_one[&#34;foo&#34;]
  * github_team.all_in_one[&#34;team-1&#34;]
  * github_team.all_in_one[&#34;team-2&#34;]
  * github_team.all_in_one[&#34;team-3&#34;]
  * github_team.all_in_one[&#34;team-4&#34;]
  * github_team.all_in_one[&#34;team-5&#34;]
  * github_team_membership.all_in_one[&#34;team-1&#34;]
  * github_team_membership.all_in_one[&#34;team-2&#34;]
  * github_team_membership.all_in_one[&#34;team-3&#34;]
  * github_team_membership.all_in_one[&#34;team-4&#34;]
  * github_team_membership.all_in_one[&#34;team-5&#34;]
  * github_team_repository.all_in_one[&#34;team-1:foo&#34;]
  * github_team_repository.all_in_one[&#34;team-2:baz&#34;]
  * github_team_repository.all_in_one[&#34;team-2:foo&#34;]
  * github_team_repository.all_in_one[&#34;team-3:bar&#34;]
  * github_team_repository.all_in_one[&#34;team-3:baz&#34;]
  * github_team_repository.all_in_one[&#34;team-3:foo&#34;]
  * github_team_repository.all_in_one[&#34;team-4:baz&#34;]
  * github_team_repository.all_in_one[&#34;team-5:bar&#34;]
  * github_team_repository.all_in_one[&#34;team-5:baz&#34;]
  * github_team_repository.all_in_one[&#34;team-5:foo&#34;]
* Update
  * github_repository.terraform_operations


<details><summary>Change Result (Click me)</summary>

```hcl

  # github_membership.org_owner["Rindrics"] will be imported
    resource "github_membership" "org_owner" {
        etag     = "W/\"b4958a3c1ac0ebeb6be6d6258ed9b21348d56713ba7a27a033bb8c9b007c8cf8\""
        id       = "rindrics-sandbox-org:Rindrics"
        role     = "admin"
        username = "Rindrics"
    }

  # github_repository.all_in_one["bar"] will be created
  + resource "github_repository" "all_in_one" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "bar"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.all_in_one["baz"] will be created
  + resource "github_repository" "all_in_one" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "baz"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.all_in_one["foo"] will be created
  + resource "github_repository" "all_in_one" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "foo"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.terraform_operations will be updated in-place
  # (imported from "github-terraform-examples")
  ~ resource "github_repository" "terraform_operations" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "Organization 配下のリソースを管理する Terraform ソースの置き場所"
        etag                        = "W/\"926953935cb2723a7f097b74a824045ca397bcf27154f57270b03505e609c73a\""
      ~ full_name                   = "rindrics-sandbox-org/terraform-operations" -> (known after apply)
        git_clone_url               = "git://github.com/rindrics-sandbox-org/terraform-operations.git"
        has_discussions             = false
        has_downloads               = false
        has_issues                  = true
        has_projects                = false
        has_wiki                    = false
        homepage_url                = null
        html_url                    = "https://github.com/rindrics-sandbox-org/terraform-operations"
        http_clone_url              = "https://github.com/rindrics-sandbox-org/terraform-operations.git"
        id                          = "github-terraform-examples"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
      ~ name                        = "github-terraform-examples" -> "terraform-operations"
        node_id                     = "R_kgDONRuOGQ"
        primary_language            = "HCL"
        private                     = false
        repo_id                     = 890998297
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:rindrics-sandbox-org/terraform-operations.git"
        svn_url                     = "https://github.com/rindrics-sandbox-org/terraform-operations"
        topics                      = []
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.terraform_state_files will be imported
    resource "github_repository" "terraform_state_files" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = false
        description                 = "リポジトリ `github-operations` の GitHub Actions から利用される Terraform state file を保管する"
        etag                        = "W/\"4805ada61d6d2694496dc8e3b68c2111c1f16e6db254e6ed8f7f0dd62eaa5379\""
        full_name                   = "rindrics-sandbox-org/terraform-state-files"
        git_clone_url               = "git://github.com/rindrics-sandbox-org/terraform-state-files.git"
        has_discussions             = false
        has_downloads               = false
        has_issues                  = false
        has_projects                = false
        has_wiki                    = false
        homepage_url                = null
        html_url                    = "https://github.com/rindrics-sandbox-org/terraform-state-files"
        http_clone_url              = "https://github.com/rindrics-sandbox-org/terraform-state-files.git"
        id                          = "terraform-state-files"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-state-files"
        node_id                     = "R_kgDONRu-jA"
        primary_language            = null
        private                     = true
        repo_id                     = 891010700
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:rindrics-sandbox-org/terraform-state-files.git"
        svn_url                     = "https://github.com/rindrics-sandbox-org/terraform-state-files"
        topics                      = []
        visibility                  = "private"
        vulnerability_alerts        = true
        web_commit_signoff_required = false
    }

  # github_team.all_in_one["team-1"] will be created
  + resource "github_team" "all_in_one" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "team-1"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.all_in_one["team-2"] will be created
  + resource "github_team" "all_in_one" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "team-2"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.all_in_one["team-3"] will be created
  + resource "github_team" "all_in_one" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "team-3"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.all_in_one["team-4"] will be created
  + resource "github_team" "all_in_one" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "team-4"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.all_in_one["team-5"] will be created
  + resource "github_team" "all_in_one" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "team-5"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.all_in_one["team-1"] will be created
  + resource "github_team_membership" "all_in_one" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "team-1"
      + username = "Rindrics"
    }

  # github_team_membership.all_in_one["team-2"] will be created
  + resource "github_team_membership" "all_in_one" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "team-2"
      + username = "Rindrics"
    }

  # github_team_membership.all_in_one["team-3"] will be created
  + resource "github_team_membership" "all_in_one" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "team-3"
      + username = "Rindrics"
    }

  # github_team_membership.all_in_one["team-4"] will be created
  + resource "github_team_membership" "all_in_one" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "team-4"
      + username = "Rindrics"
    }

  # github_team_membership.all_in_one["team-5"] will be created
  + resource "github_team_membership" "all_in_one" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "team-5"
      + username = "Rindrics"
    }

  # github_team_repository.all_in_one["team-1:foo"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "foo"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-2:baz"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "baz"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-2:foo"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "foo"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-3:bar"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "bar"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-3:baz"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "baz"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-3:foo"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "foo"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-4:baz"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "baz"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-5:bar"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "bar"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-5:baz"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "baz"
      + team_id    = (known after apply)
    }

  # github_team_repository.all_in_one["team-5:foo"] will be created
  + resource "github_team_repository" "all_in_one" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "foo"
      + team_id    = (known after apply)
    }

Plan: 3 to import, 23 to add, 1 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":6,"Program":"tfcmt","SHA1":"812980d6b7dc9da586ffcd1d5c905489b88c49d7","Vars":{},"WorkflowName":"terraform-plan"} -->